results/out/aleph.ring-middleware.async.java17.G1GC.r20k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 2.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.250ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.280ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.230ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.119ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.220ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.226ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.237ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.277ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.322ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.663ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 2.379ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.521ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.234ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.392ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.05ms    3.01ms  71.87ms   91.47%
    Req/Sec     1.32k   503.81     6.00k    70.02%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.21ms
 75.000%    1.81ms
 90.000%    4.35ms
 99.000%   16.16ms
 99.900%   29.60ms
 99.990%   39.84ms
 99.999%   49.31ms
100.000%   71.93ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.081     0.000000            1         1.00
       0.483     0.100000      1184656         1.11
       0.692     0.200000      2360164         1.25
       0.874     0.300000      3540708         1.43
       1.043     0.400000      4723150         1.67
       1.210     0.500000      5904797         2.00
       1.298     0.550000      6490780         2.22
       1.395     0.600000      7083055         2.50
       1.506     0.650000      7671735         2.86
       1.640     0.700000      8261553         3.33
       1.813     0.750000      8849899         4.00
       1.927     0.775000      9144878         4.44
       2.077     0.800000      9439168         5.00
       2.297     0.825000      9734856         5.71
       2.649     0.850000     10028386         6.67
       3.353     0.875000     10323012         8.00
       3.823     0.887500     10470321         8.89
       4.351     0.900000     10617712        10.00
       4.951     0.912500     10766029        11.43
       5.631     0.925000     10913430        13.33
       6.415     0.937500     11060402        16.00
       6.863     0.943750     11134169        17.78
       7.367     0.950000     11207787        20.00
       7.951     0.956250     11281515        22.86
       8.663     0.962500     11355624        26.67
       9.575     0.968750     11429252        32.00
      10.111     0.971875     11465920        35.56
      10.735     0.975000     11502907        40.00
      11.463     0.978125     11539671        45.71
      12.311     0.981250     11576372        53.33
      13.399     0.984375     11613151        64.00
      14.039     0.985938     11631531        71.11
      14.767     0.987500     11649973        80.00
      15.599     0.989062     11668444        91.43
      16.559     0.990625     11686954       106.67
      17.727     0.992188     11705447       128.00
      18.399     0.992969     11714608       142.22
      19.119     0.993750     11723715       160.00
      19.935     0.994531     11733006       182.86
      20.927     0.995313     11742186       213.33
      22.111     0.996094     11751409       256.00
      22.767     0.996484     11756044       284.44
      23.439     0.996875     11760577       320.00
      24.207     0.997266     11765229       365.71
      25.087     0.997656     11769799       426.67
      26.127     0.998047     11774450       512.00
      26.703     0.998242     11776741       568.89
      27.311     0.998437     11779030       640.00
      27.983     0.998633     11781303       731.43
      28.783     0.998828     11783640       853.33
      29.727     0.999023     11785928      1024.00
      30.271     0.999121     11787070      1137.78
      30.847     0.999219     11788219      1280.00
      31.487     0.999316     11789375      1462.86
      32.207     0.999414     11790532      1706.67
      33.087     0.999512     11791690      2048.00
      33.631     0.999561     11792259      2275.56
      34.143     0.999609     11792843      2560.00
      34.751     0.999658     11793416      2925.71
      35.391     0.999707     11793982      3413.33
      36.159     0.999756     11794569      4096.00
      36.639     0.999780     11794846      4551.11
      37.119     0.999805     11795129      5120.00
      37.663     0.999829     11795419      5851.43
      38.239     0.999854     11795702      6826.67
      39.039     0.999878     11795996      8192.00
      39.487     0.999890     11796138      9102.22
      39.967     0.999902     11796280     10240.00
      40.479     0.999915     11796428     11702.86
      41.151     0.999927     11796572     13653.33
      41.791     0.999939     11796711     16384.00
      42.207     0.999945     11796785     18204.44
      42.719     0.999951     11796854     20480.00
      43.199     0.999957     11796927     23405.71
      43.839     0.999963     11797000     27306.67
      44.831     0.999969     11797071     32768.00
      45.215     0.999973     11797108     36408.89
      45.791     0.999976     11797142     40960.00
      46.271     0.999979     11797180     46811.43
      46.911     0.999982     11797214     54613.33
      47.583     0.999985     11797253     65536.00
      47.871     0.999986     11797268     72817.78
      48.319     0.999988     11797287     81920.00
      48.863     0.999989     11797305     93622.86
      49.759     0.999991     11797324    109226.67
      50.335     0.999992     11797341    131072.00
      50.975     0.999993     11797352    145635.56
      51.263     0.999994     11797358    163840.00
      51.775     0.999995     11797367    187245.71
      52.415     0.999995     11797376    218453.33
      53.215     0.999996     11797385    262144.00
      53.855     0.999997     11797390    291271.11
      54.239     0.999997     11797396    327680.00
      54.719     0.999997     11797399    374491.43
      55.199     0.999998     11797403    436906.67
      55.615     0.999998     11797408    524288.00
      56.031     0.999998     11797410    582542.22
      56.127     0.999998     11797412    655360.00
      56.447     0.999999     11797415    748982.86
      57.023     0.999999     11797417    873813.33
      57.727     0.999999     11797419   1048576.00
      57.759     0.999999     11797420   1165084.44
      57.919     0.999999     11797421   1310720.00
      58.111     0.999999     11797423   1497965.71
      58.975     0.999999     11797424   1747626.67
      59.167     1.000000     11797425   2097152.00
      59.167     1.000000     11797425   2330168.89
      59.807     1.000000     11797426   2621440.00
      60.095     1.000000     11797427   2995931.43
      60.095     1.000000     11797427   3495253.33
      60.639     1.000000     11797428   4194304.00
      60.639     1.000000     11797428   4660337.78
      60.639     1.000000     11797428   5242880.00
      63.455     1.000000     11797429   5991862.86
      63.455     1.000000     11797429   6990506.67
      63.455     1.000000     11797429   8388608.00
      63.455     1.000000     11797429   9320675.55
      63.455     1.000000     11797429  10485760.00
      71.935     1.000000     11797430  11983725.71
      71.935     1.000000     11797430          inf
#[Mean    =        2.050, StdDeviation   =        3.011]
#[Max     =       71.872, Total count    =     11797430]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11996419 requests in 10.00m, 2.00GB read
Requests/sec:  19993.97
Transfer/sec:      3.41MB